{
  "about": {
    "greeting": "Hello, I'm Jae Kim.",
    "intro": "Hi! I'm a frontend developer with 4 years of experience, passionate about writing clean, understandable code that anyone can pick up and continue. I enjoy creating streamlined development workflows and pay close attention to the small details, and make sure every interaction feels intuitive and seamless. I’m always mindful of performance, aiming to keep things as fast and lightweight as possible.",
    "description1": "As a Canadian citizen currently living in South Korea with F-4 visa, I’ve had the opportunity to work with teammates from a variety of cultural backgrounds, allowing me to collaborate smoothly and communicate clearly across different perspectives. I genuinely enjoy working with others, love networking, and often find energy in sharing ideas and knowledge — whether it’s over coffee chats or during deep dives into technical topics.",
    "description2": "Currently, I’m working at E8ight as a frontend developer on the Platform Development Team, contributing to various B2B SaaS projects. This website is my personal space to explore new technologies, test ideas freely, and document what I learn along the way."
  },
  "resume": {
    "introduce": {
    "paragraph1": "Hello, I’m a frontend developer with {years} of hands on experience building web applications from early planning through to deployment and maintenance. I care about performance, maintainability, and creating interfaces that feel smooth and intuitive.",
    "paragraph2": "I enjoy writing clean code that others can pick up and understand. I regularly explore new tools, libraries, and techniques — adopting what genuinely improves my workflow or enhances the user experience. I’m always learning and striving to grow in both depth and breadth as a developer.",
    "paragraph3": "I’m a Canadian citizen currently living in Korea on an F-4 visa. I’ve worked with people from many different backgrounds and believe strong communication is one of the most important parts of building great products together."
  },
    "work": {
      "e8ight": {
        "period": "2024.01 ~",
        "company": "E8ight",
        "location": "Seoul, South Korea",
        "position": "Frontend Developer (Platform)",
        "details": [
          "Established a reusable frontend template to accelerate development setup across internal projects",
          "Built and maintained a shared design system and component library, improving collaboration with designers via Storybook",
          "Improved initial load time of key products by ~80% through network and rendering optimizations (10s → 2s)",
          "Applied virtualization techniques to enable smooth rendering of large-scale datasets"
        ],
        "projects": {
          "ndxpro_pmis": {
            "title": "NDXPRO PMIS",
            "tasks": {
              "gantt_chart": {
                "title": "Developed Custom Gantt Chart (WBS based)",
                "subtasks": [
                  "Designed and implemented a custom Gantt chart architecture to overcome limitations of third-party libraries",
                  "Developed task dependencies (FS, SS, SF, FF) using optimized SVG Path logic, maintaining performance and clarity in large scale project environments",
                  "Enabled intuitive task editing through drag-and-drop interaction for modifying task order, hierarchy, and schedule",
                  "Applied optimistic UI using TanStack Query to instantly reflect task changes during interactions, with rollback on failure to preserve data integrity",
                  "Improved rendering performance of thousands of tasks with virtualization and lazy loading, reducing DOM workload by 40%"
                ]
              },
              "drawing_system": {
                "title": "Drawing Management System",
                "subtasks": [
                  "Built a recursive file tree component to visualize folder structures and render large datasets efficiently",
                  "Implemented a web-based file explorer with OS-level features like multi-select and keyboard shortcuts",
                  "Enabled folder-level bulk uploads using webkitdirectory with responsive, asynchronous processing and robust error handling",
                  "Designed a version control system for engineering documents, enabling revision tracking and file history management",
                  "Developed file preview functionality supporting multiple file types"
                ]
              }
            }
          },
          "ndxpro_epc": {
            "title": "NDXPRO EPC",
            "link": "https://www.youtube.com/watch?v=ZjW2mqULi_k&ab_channel=E8%7C%EC%9D%B4%EC%97%90%EC%9D%B4%ED%8A%B8",
            "tasks": {
              "viewer_markup": {
                "title": "2D Drawing Viewer & Markup Tools",
                "subtasks": [
                  "Implemented an SVG-based 2D viewer with zoom and interaction capabilities for exploring complex drawings",
                  "Built markup tools (text, lines, curves) and interactions for editing within the viewer",
                  "Applied precise SVG coordinate scaling to maintain markup element positioning during zooming",
                  "Streamlined the drawing editing workflow with create/delete markup interactions"
                ]
              },
              "dashboard_layout": {
                "title": "Customizable Dashboard with Grid Layout",
                "subtasks": [
                  "Led the integration of a dynamic dashboard system using a customized React Grid Layout",
                  "Enabled seamless communication between embedded 3D viewer and main app using postMessage API"
                ]
              }
            }
          }
        }
      },
      "flashee": {
        "period": "2023.07 ~ 2023.10",
        "company": "Flashee",
        "location": "Vancouver, Canada",
        "position": "Frontend Developer",
        "details": [
          "Joined as the first developer and led the end-to-end planning, development, deployment, and maintenance of all frontend services for a unified clothing marketplace startup",
          "Built a robust E-Commerce platform with seamless integration of multiple Shopify marketplaces",
          "Improved user authentication and security through integration with Supabase and third-party login providers (Instagram, TikTok, etc.)",
          "Integrated Shopify Payments to reduce cart abandonment and increase successful transactions",
          "Set up a scalable cloud environment using AWS and Fly.io",
          "Contributed to early revenue generation by enabling rapid onboarding and supporting a successful soft launch"
        ]
      },
      "iclinic": {
        "period": "2022.07 ~ 2023.06",
        "company": "iClinic Systems Inc.",
        "location": "Vancouver, Canada",
        "position": "Full Stack Developer",
        "details": [
          "Developed a full marketing microsite using WebGL to deliver a modern, interactive web experience",
          "Built immersive UI interactions with Framer Motion and GSAP, enhancing user engagement",
          "Designed and maintained an internal admin portal for workforce and attendance management, accessible to non-technical stakeholders",
          "Managed AWS infrastructure, backend services, NoSQL data modeling, and server deployments",
          "Developed and maintained RESTful APIs with full CRUD capabilities for client-facing applications",
          "Implemented automated email workflows using AWS SES and Node.js within an Angular-based admin dashboard",
          "Deployed backend services using NGINX with zero-downtime strategies",
          "Applied Google Analytics to analyze and improve user engagement",
          "Set up CI/CD pipelines using GitHub Actions for reliable and efficient deployments"
        ]
      },
      "catalyx": {
        "period": "2021.01 ~ 2022.05",
        "company": "Catalx Management Ltd.",
        "location": "Vancouver, Canada",
        "position": "Frontend Developer",
        "details": [
          "Integrated multiple third-party systems to enable credit card purchases of cryptocurrencies",
          "Migrated REST APIs to GraphQL using Apollo, significantly improving app performance and flexibility",
          "Built a social sharing preview feature using AWS Lambda@Edge and Facebook Open Graph",
          "Collaborated closely with designers to improve the overall user experience and interface design"
        ]
      }
    }
  },

  "utils": {
    "year": "{count} year",
    "month": "{count} month",
    "year_plural": "{count} years",
    "month_plural": "{count} months",
    "yearAndMonth": "{year} {month}"
  }
}
